INSERT INTO public.reader (ticket_num, full_name, address_reader, num_phone)
VALUES (101, 'Алексеев Алексей Алексеевич', 'г. Москва, ул. Московска 1', '+7(918)111-11-11'),
       (102, 'Петров Пётр Петрович', 'г. Москва, ул. Красная 1', '+7(918)222-22-22'),
       (103, 'Иванов Иван Иванович', 'г. Москва, ул. Ленина 1', '+7(918)333-33-33'),
       (104, 'Михайлов Михаил Михайлович', 'г. Москва, ул. Российская 1', '+7(918)444-44-44'),
       (105, 'Александров Александр Александрович', 'г. Москва, ул. Пушкина 1', '+7(918)555-55-55');

INSERT INTO public.publish_house (title)
VALUES ('ЭКСМО'), ('Печатный Дом'), ('Литература');

INSERT INTO public.book (cipher_book, title, year_public, volume_pages, price, count_instances, publish_house_id)
VALUES (1001, 'Война и мир', 2022, 1000, 999.99, 4, 3),
       (1002, 'Гарри Поттер и философский камень', 2005, 450, 599.99, 5, 1),
       (1003, 'Бегущий человек', 2015, 288, 159.99, 2, 2),
       (1004, 'Собачье сердце', 2021, 299, 315.00, 3, 3),
       (1005, 'Одноэтажная америка', 2021, 512, 137.00, 5, 1),
       (1006, 'Дневной дозор', 2020, 384, 534.00, 1, 2),
       (1007, 'Сияние', 2014, 544, 399.99, 6, 1),
       (1008, 'Гарри Поттер и тайная комната', 2014, 480, 471.00, 5, 1);

INSERT INTO public.author (full_name)
VALUES ('Лев Николаевич Толстой'),
       ('Джоан К. Роулинг'),
       ('Стивен Кинг'),
       ('Михаил Афанасьевич Булгаков'),
       ('Илья Арнольдович Ильф'),
       ('Евгений Петрович Петров'),
       ('Сергей Васильевич Лукьяненко'),
       ('Владимир Николаевич Васильев');

INSERT INTO public.city (name_city)
VALUES ('Москва'), ('Санкт-Петербург'),
       ('Краснодар'), ('Владивосток');

INSERT INTO public.reader_book (reader_id, book_id, date_receipt, date_return)
VALUES (2, 3, '2023-03-01', '2023-03-08'),
       (2, 5, '2023-03-01', '2023-03-08'),
       (1, 5, '2023-04-02', '2023-04-15'),
       (1, 1, '2023-04-02', '2023-04-15'),
       (1, 6, '2023-04-02', '2023-04-15'),
       (4, 2, '2023-05-10', '2023-05-30'),
       (4, 7, '2023-05-10', '2023-05-30'),
       (4, 8, '2023-05-10', '2023-05-30'),
       (4, 4, '2023-05-10', '2023-05-30');

INSERT INTO public.reader_book (reader_id, book_id, date_receipt)
VALUES (2, 1, '2023-05-20');

INSERT INTO public.reader_book (reader_id, book_id)
VALUES (3, 4);

INSERT INTO public.book_author (book_id, author_id)
VALUES (1, 1), (2, 2), (3, 3), (4, 4), (5, 5),
       (5, 6), (6, 7), (6, 8), (7, 3), (8, 2);

INSERT INTO public.city_publish_house (city_id, publish_house_id)
VALUES (1, 1), (1, 2), (1, 3), (2, 1),
       (2, 3), (3, 2), (4, 1);

INSERT INTO public.lose_book (book_id, date_lose, reader_id)
VALUES (1, '2023-01-01', 1),
       (2, '2023-04-01', 2),
       (4, '2023-06-02', 3);